//////////memcpy()函数
////////拷贝某空间n字节内容到目标空间中
//////          ||
//memcmp()函数，比较n个字节的两空间
////memmove()函数
////与memcpy不同之处
////在于memmove处理的内存块
////可以重叠
////
////
////
//////#include <stdio.h>
//////
//////
//////
//////
//////
//////#include <string.h>
////////
//////int main() {
//////    int arr[10];
//////    int* pa = NULL;
//////    pa = (int*)calloc(sizeof(int),100);
//////    if (pa)
//////    {
//////        for (int i = 0; i < 100; i++)
//////        {
//////            *(pa+i) = i  +1 ;
//////        }
//////    }
//////    int* pb = NULL;
//////    //pb = (int*)malloc(10*sizeof(int));
//////    pb = pa +67;
////////    if (pb)
////////    {
//////        memcpy(pa,pb,sizeof(int)*10);
////////    }
////////    for(int i = 0; i < 10; i++)
////////    {
////////        printf("%d ",*(pa+i));
////////    }
//////
//////
////////    for(int i = 0; i < 10; i++)
////////    {
////////        printf("%d\n",*(pb+i));
////////    }
//////
//////
//////memmove(pb,pa,sizeof(int)*100);
//////
//////
//////    for(int i = 0; i < 100; i++)
//////    {
//////        printf("%d ",*(pa+i));
//////    }
//////    
//////    
//////    return 0;
//////}
//////
//////
//////
//////
//////
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//