#include "chess_date.h"

void menu()
{
    printf("######################################################\n");
    printf("######################①游戏开始######################\n");
    printf("######################②游戏设置######################\n");
    printf("######################③更多游戏######################\n");
    printf("######################④退出游戏######################\n");
    printf("######################################################\n");
}

int main() {
    menu();
    do
    {
        char c = getchar();
        switch (c)
        {
        case '1':
            Game();
            break;
        case '2':
            printf("敬请期待!");
            continue;
        case '3':
            system("start http://4399.com");
            break;
        case '4':
            return 0;
        }
    } while (1);

    return 0;
}